# MacBook Pro M4 Max Brewfile
# Run with: brew bundle

# Taps
tap "homebrew/cask"
tap "homebrew/core"

# Command line tools
brew "git"
brew "node"
brew "python@3.11"
brew "sqlite"
brew "dockutil"
# Claude Code CLI installed via npm (see install.sh)

# GUI Applications (Casks)
cask "android-studio"
cask "cursor"
cask "visual-studio-code"
cask "brave-browser"
cask "google-chrome"
cask "spotify"
cask "slack"
cask "1password"
cask "zoom"
cask "db-browser-for-sqlite"
cask "mongodb-realm-studio"
cask "figma"

# Additional productivity tools
cask "rectangle"
# cask "alfred"
cask "caffeine"
cask "appcleaner"
cask "the-unarchiver"
cask "proxyman"
cask "iterm2"

# Command line tools
brew "vim"

# Development tools
cask "postman"
cask "docker"
cask "mongodb-compass"

# Android development tools
cask "android-platform-tools"
cask "android-file-transfer"
cask "scrcpy"
cask "genymotion"
# cask "charles"
# cask "wireshark"
# cask "burp-suite"
cask "apktool"
cask "dex2jar"
cask "jd-gui"

# Flutter development tools
cask "flutter"
cask "dart"
cask "fvm"
# cask "codemagic"
cask "firebase-cli"
cask "firebase-emulator"

# KMM development tools
cask "kotlin"
cask "kotlin-native"
# cask "gradle"
# cask "maven"
# cask "intellij-idea-ce"
# cask "android-studio-preview"

# Fonts
tap "homebrew/cask-fonts"
cask "font-fira-code"
cask "font-jetbrains-mono"
